ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
       $model = new ArtikelModel();
       $data = [
          'title' => 'Daftar Artikel',
          'subtitle' => 'Daftar Artikel',
          'artikel' => $model->findAll()